#include <iostream>

#include "compiler/supercompiler/compiler.h"
#include "parser.h"

int main() {
  const auto code = R"(
макет структура Дія
  назва текст
кінець

макет структура логічне
  чародія_створити(значення обʼєкт) логічне
  чародія_логічне() логічне
  чародія_число() число
  чародія_текст() текст
кінець

макет субʼєкт так логічне
макет субʼєкт ні логічне

макет структура число
  чародія_створити(значення число) число
  чародія_додати(значення число) число
  чародія_відняти(значення число) число
  чародія_помножити(значення число) число
  чародія_поділити(значення число) число
  чародія_логічне() логічне
  чародія_число() число
  чародія_текст() текст
кінець

макет структура текст
  довжина число

  чародія_створити(значення текст) текст
  чародія_додати(значення текст) текст
  чародія_логічне() логічне
  чародія_число() число
  чародія_текст() текст
кінець

макет структура список
  довжина число

  ключі() список
  чародія_покласти(позиція число, значення обʼєкт) обʼєкт
  чародія_отримати(позиція число) обʼєкт
  чародія_логічне() логічне
  чародія_число() число
  чародія_текст() текст
кінець

макет структура словник
  чародія_отримати(позиція обʼєкт) обʼєкт

  її розмір(значення словник) число
кінець

макет дія друк(...значення список)

;; ---

а = ()
а = а + а
)";
  const auto parser_result = mavka::parser::parse(code);
  if (parser_result->error) {
    std::cout << parser_result->error->message << std::endl;
    return 1;
  }
  const auto result = supercompiler::compile(parser_result->program_node);
  if (result->error) {
    if (result->error->full) {
      std::cout << result->error->line << ":" << result->error->column << ": ";
    }
    std::cout << result->error->message << std::endl;
    return 1;
  }
  std::cout << "compilation successful" << std::endl;
  return 0;
}