var м_софт, м_М;
м_М = 2;
/* --- js --- */
console.log('lol')
/* --- /js --- */;
м_софт = мДі("софт", [мПр("х")], function () {
    var м_а, м_результат, м_сума, м_х1, м_е, м_д_х, м_х;
    м_д_х = мВі(мВк(мОт(м_х, "довжина"), {}), 1);
    м_е = [];
    for (м_х1 of мІтер(мВід(0, м_д_х, "<=", мВідФ("+", 1)))) {
        мВсЕ(м_е, м_х1, мВк(мОт(м_М, "експ"), {0: мОт(м_х, м_х1)}));
    }
    ;
    м_сума = 0.0;
    for (м_х1 of мІтер(мВід(0, м_д_х, "<=", мВідФ("+", 1)))) {
        м_сума = мОт(м_е, м_х1);
    }
    ;
    м_результат = [];
    for ([м_а, м_х1] of мІтерП(мВід(0, м_д_х, "<=", мВідФ("+", 1)))) {
        мВсЕ(м_результат, м_х1, мДл(мОт(м_е, м_х1), м_сума));
    }
    ;
    return м_результат;
});
